<?php
// +----------------------------------------------------------------------
// | 会员模型
// +----------------------------------------------------------------------
// | 时间：2015-3-13
// +----------------------------------------------------------------------
// | Author: midadong <turn8888@163.com>
// +----------------------------------------------------------------------
namespace Admin\Model;
use Think\Model;
class AuthGroupAccessModel extends Model{
		
		
	
	/**
	 * 验证规则
	 * @author dadong <turn8888@163.com>
	 */	
	protected $_validate = array(
		array('uid','require','亲您是误操作哦'), // 在新增/修改的时候验证用户名不能为空
		array('group_id','require','请给当前会员分配权限','1') // 在新增/修改的时候验证用户名不能为空
	);
}












